Revit 2022 API
AnalyticalModel.IsValidDirectionForAutoDetect Method
 Tests if the supplied direction is valid for Analytical Auto-detect.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public bool IsValidDirectionForAutoDetect(
	AnalyticalDirection direction
)
Visual Basic
Public Function IsValidDirectionForAutoDetect ( _
	direction As AnalyticalDirection _
) As Boolean
Visual C++
public:
bool IsValidDirectionForAutoDetect(
	AnalyticalDirection direction
)
Parameters
direction
Type: Autodesk.Revit.DB.Structure.AnalyticalDirection
 Direction in which Auto-detect behavior may be valid.
Return Value
 True if direction is valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace